app/controllers/accordions_controller.rb

def index
  @accordions = Accordion.all
---
SELECT * FROM `accordions` ORDER BY accordions.id DESC LIMIT 1

  def show
    @accordion = Accordion.find(params[:id])
---
SELECT * FROM `accordions` WHERE (`accordions`.`id` = 0)

def memo
  @notes_all = NotesManager.all
---
SELECT * FROM `notes_managers` ORDER BY notes_managers.id DESC LIMIT 1

def update_note
  n = NotesManager.find_by_note_id(params[:note_id])
  n.update_attributes(:description=>params[:description])
---
SELECT * FROM `notes_managers` WHERE (`notes_managers`.`note_id` = '1') LIMIT 1
UPDATE `notes_managers` SET `description` = 'asdf', `updated_at` = '2013-08-29 11:17:24' WHERE `id` = 77

def create_note
    NotesManager.create(:note_id=>params[:note_id])
---
INSERT INTO `notes_managers` (`description`, `note_id`, `created_at`, `updated_at`, `accordion_id`) VALUES(NULL, 15, '2013-08-29 11:17:14', '2013-08-29 11:17:14', NULL)

def delete_note
    NotesManager.find_by_note_id(params[:note_id]).delete
---
DELETE FROM `notes_managers` WHERE (`id` IN (9))
SELECT * FROM `notes_managers` WHERE (`notes_managers`.`note_id` = '1') LIMIT 1

  def new
    @accordion = Accordion.new

   first = Accordion.first
---
SELECT * FROM `accordions` LIMIT 1

  def edit
    @accordion = Accordion.find(params[:id])
---
SELECT * FROM `accordions` WHERE (`accordions`.`id` = 2)

  def create
    @accordion = Accordion.new(params[:accordion])

    respond_to do |format|
      if @accordion.save
---
INSERT INTO `accordions` (`updated_at`, `heading`, `image`, `paragraph`, `created_at`) VALUES('2013-10-16 10:42:33', 'Marketing stuff!', 'logo-one.png', 'Cras justo odio, dapibus ac facilisis in, egestas eget quam. Fusce dapibus, tellus ac cursus commodo, tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus.', '2013-10-16 10:42:33')

  def update
    @accordion = Accordion.find(params[:id])

    respond_to do |format|
      if @accordion.update_attributes(params[:accordion])
---
SELECT * FROM `accordions` WHERE (`accordions`.`id` = 2)
UPDATE `accordions` SET `updated_at` = '2013-03-22 10:33:07', `paragraph` = 'Cras justo odio, dapibus ac facilisis in, egestas eget quam. Fusce dapibus, tellus ac cursus commodo, tortor mauris condimentum nibh, ut fermentum massa justo sit amet risus.' WHERE `id` = 1

  def destroy
    @accordion = Accordion.find(params[:id])
    @accordion.destroy
---
SELECT * FROM `accordions` WHERE (`accordions`.`id` = 1)
DELETE FROM `accordions` WHERE `id` = 1