app/controllers/attendences_controller.rb

  def index
    @attendences = Attendence.all
---
SELECT * FROM `attendences`

  def show
    @attendence = Attendence.find(params[:id])
---
SELECT * FROM `attendences` WHERE (`attendences`.`id` = 7)

  def create
    @attendence = Attendence.new(params[:attendence])
#     gods = params[:gods]
#     presence = params[:presence]
#     s=""
#     hash={}
#     for i in 0...presence.length
#       hash.store('st_no',gods[i])
#       hash.store('pr_no',presence[i])
#       s+=hash.to_s
#     end
#     gods=["ram","laxman","hanuman","sai"]
#     presence=["yes","no","yes","no"]
#     s1=""
#     for i in 0...presence.length
#       hash.store('st_no',gods[i])
#       hash.store('pr_no',presence[i])
#       s1+=hash.to_s
#     end

# output i want : {{"st_no"=>"ram", "pr_no"=>"yes"},{"st_no"=>"laxman", "pr_no"=>"no"},{"st_no"=>"hanuman", "pr_no"=>"yes"},{"st_no"=>"sai", "pr_no"=>"no"}}
    respond_to do |format|
      if @attendence.save
---
INSERT INTO `attendences` (`updated_at`, `group`, `year`, `created_at`) VALUES('2013-10-16 10:37:47', 'gggggggg', '2012', '2013-10-16 10:37:47')